Route 길 경로
Routing 라우팅 길찾기 (최적의 경로찾기) - Routing Table(RAM)
Router 라우터


cpu
rom
ram
flash 저장장치  
	-flash:  (IOS저장) c2811버전정보.bin
	-nvram: (설정파일) startup-config
interface 
	ethernet  10M
	fast ethernet 100M
	giga ethernet 1000M(1G)
	serial 
line	
	console
	vty (telnet원격접속)
	aux (모뎀)
......

*config 파일 
	저장된 설정파일 startup-config (nvram:에 위치)
	메모리 작동중인 파일 running-config (메모리에 위치)

부팅을 해서 설정을 하면 running-config가 변경됨.
설정변경을 했을 경우, running-config를 반드시 저장해야함.
#copy running-config startup-config
#wr (write memory)




Router>  정상적인 부팅

rommon>       	ROM MONITER


#conf t
#int fa0/0
#ip address 218.39.221.126 255.255.255.192
#no shutdown
#end
#show ip int brief
#show running-config
#copy running-config startup-config
#show startup-config

#show int fa0/0
#show ip int fa0/0

 시스코 장비 IOS 특징.
   1) ? 
	입력가능한 명령어와 설명보기
	Router> ?   : User exec mode에서 입력가능한 명령어
	Router# ?    : Privileged exec mode 에서 명령어 확인
	Router# show : show 하위 명령어 확인
	Router> e?   : e로 시작하는 명령어 확인
   2) 'tab'키로 자동완성
	?했을 때 명령어 목록이 하나만 있을 때에만 가능
   3) 줄임 명령어 가능
	Router> en   (enable을 모두 입력하지 않고 en만으로도)
	Router# conf t (configure terminal 줄여서 사용가능)
   4) 입력 중 커서이동에 대한 단축키
	Ctrl+a  : 라인 내에서 커서를 가장 앞 으로 이동
	Ctrl+e : 라인 내에서 커서를 문장 끝으로 이동
	Ctrl+w : 현 커서앞으로 한단어 삭제


라우터 : OSI 3 Layer 장비
  IP 주소할당 가능.
  IP주소로된 라우팅 테이블 유지함
  패킷을 수신하여 목적지 IP주소를 라우팅 테이블과 비교하여 전달할 인터페이스를 결정 후 다음라우터에게 전달함
  IP, IPX, apple talk등 여러 주소가 가능하나 요즘에는 IP주소를 대부분사용하기때문에 IP주소만 가능한 IOS가 대부분이다.
  패킷을 수신했을 때 목적지 IP주소가 라우팅 테이블에 없으면
  해당 패킷은 drop 함(버림)
  관리자는 라우터에 사용하기위한 인터페이스를 연결한 경우 해당 인터페이스에 대한 설정이 필요하다.
  연결한 인터페이스에 대한 활성화, IP/sm 설정을  해야함.

*라우터에 IP주소를 할당해야하는 이유
  -pc들의 게이트웨이로 설정하여 pc들에게 알려주어야함
  -해당 인터페이스 활성화 ip/sm 설정하면 라우팅 테이블에 네트워크로 인식하여 인스톨 됨.-라우팅 테이블 유지

=======================================
packetTracer



ip route

cisco ios
시스코 라우터 모드
 Router>	enable		User exec mode
	설정 X , 정보 보기 (일부 정보만), 명령어실행
 Router#	configure terminal	Privileged exec mode
	설정 X, 정보 보기 (모든 정보), 명령어실행

 Router(config)#		Global configuration mode
	라우터 자체적인 설정(이름, 계정생성 등)
 Router(config-if)#		Sub configuration mode
 Router(config-subif)#
 Router(config-router)#
 Router(config-line)#
	.... 등

Router>   user exec mode
Router#   Privileged Exec mode
Router(config)#   Global configuration mode
Router(config-if)#    interface 
Router(config-router)#   router


===========================
인터페이스 셋팅

Router# config
Router(config)#int fa0/1
Router(config-if)#
Router#configure terminal
Router(config)#interface fastEthernet 0/0      ->   interface GigabitEthernet 0/0
Router(config-if)#ip address 192.168.100.254 255.255.255.0
Router(config-if)#no shutdown


========================
static 라우팅
스태틱 라우팅 테이블 구성


R1 , R2  간에 
라우팅 셋팅 전 
인터페이스 등록 후 
Router# ping  명령으로   R1,R2 사이의  통신이 되는지 먼저 확인 필요 
		일반 시스템의 ping 명령어와 결과가 다름   

R1
Router# config
Router(config)# ip route 192.168.200.0 255.255.255.0 10.10.10.2
Router(config)# ip route 10.10.10.0 255.255.255.0 10.10.10.2
Router(config)# end
Router# show ip route

R2
Router# config
Router(config)# ip route 192.168.100.0 255.255.255.0 10.10.10.1
Router(config)# ip route 10.10.10.0 255.255.255.0 10.10.10.1
Router(config)# end
Router# show ip route


테스트  pc1 에서 pc3  또는 pc3 에서 pc1 으로 ping 테스트 


-------------------------------------

10.
R1,R2,R3  인터페이스 셋팅 후  할당된 인접 인터페이스로 ping 테스트 확인 필요 


R1
Router# config
Router(config)# ip route 192.168.20.0 255.255.255.0 10.10.20.2
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.20.2
Router(config)# ip route 192.168.30.0 255.255.255.0 10.10.20.2
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.20.2
Router(config)# end
Router# show ip route

R2
Router# config
Router(config)# ip route 192.168.10.0 255.255.255.0 10.10.20.1
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.20.1
Router(config)# ip route 192.168.30.0 255.255.255.0 10.10.30.2
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.30.2
Router(config)# end
Router# show ip route

R3
Router# config
Router(config)# ip route 192.168.20.0 255.255.255.0 10.10.30.1
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.30.1
Router(config)# ip route 192.168.10.0 255.255.255.0 10.10.30.1
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.30.1
Router(config)# end
Router# show ip route



















https://err-bzz.oopy.io/c4abbed2-fc30-4061-81b0-2803c4a59809





Route 길 경로
Routing 라우팅 길찾기 (최적의 경로찾기) - Routing Table(RAM)
Router 라우터


cpu
rom
ram
flash 저장장치  
	-flash:  (IOS저장) c2811버전정보.bin
	-nvram: (설정파일) startup-config
interface 
	ethernet  10M
	fast ethernet 100M
	giga ethernet 1000M(1G)
	serial 
line	
	console
	vty (telnet원격접속)
	aux (모뎀)
......

*config 파일
	저장된 설정파일 startup-config (nvram:에 위치)
	메모리 작동중인 파일 running-config (메모리에 위치)

부팅을 해서 설정을 하면 running-config가 변경됨.
설정변경을 했을 경우, running-config를 반드시 저장해야함.
#copy running-config startup-config
#wr (write memory)




Router>  정상적인 부팅

rommon>       	ROM MONITER


#conf t
#int fa0/0
#ip address 218.39.221.126 255.255.255.192
#no shutdown
#end
#show ip int brief
#show running-config
#copy running-config startup-config
#show startup-config

#show int fa0/0
#show ip int fa0/0

 시스코 장비 IOS 특징.
   1) ? 
	입력가능한 명령어와 설명보기
	Router> ?   : User exec mode에서 입력가능한 명령어
	Router# ?    : Privileged exec mode 에서 명령어 확인
	Router# show : show 하위 명령어 확인
	Router> e?   : e로 시작하는 명령어 확인
   2) 'tab'키로 자동완성
	?했을 때 명령어 목록이 하나만 있을 때에만 가능
   3) 줄임 명령어 가능
	Router> en   (enable을 모두 입력하지 않고 en만으로도)
	Router# conf t (configure terminal 줄여서 사용가능)
   4) 입력 중 커서이동에 대한 단축키
	Ctrl+a  : 라인 내에서 커서를 가장 앞 으로 이동
	Ctrl+e : 라인 내에서 커서를 문장 끝으로 이동
	Ctrl+w : 현 커서앞으로 한단어 삭제


라우터 : OSI 3 Layer 장비
  IP 주소할당 가능.
  IP주소로된 라우팅 테이블 유지함
  패킷을 수신하여 목적지 IP주소를 라우팅 테이블과 비교하여 전달할 인터페이스를 결정 후 다음라우터에게 전달함
  IP, IPX, apple talk등 여러 주소가 가능하나 요즘에는 IP주소를 대부분사용하기때문에 IP주소만 가능한 IOS가 대부분이다.
  패킷을 수신했을 때 목적지 IP주소가 라우팅 테이블에 없으면
  해당 패킷은 drop 함(버림)
  관리자는 라우터에 사용하기위한 인터페이스를 연결한 경우 해당 인터페이스에 대한 설정이 필요하다.
  연결한 인터페이스에 대한 활성화, IP/sm 설정을  해야함.

*라우터에 IP주소를 할당해야하는 이유
  -pc들의 게이트웨이로 설정하여 pc들에게 알려주어야함
  -해당 인터페이스 활성화 ip/sm 설정하면 라우팅 테이블에 네트워크로 인식하여 인스톨 됨.-라우팅 테이블 유지

=======================================

시스코 라우터 모드
 Router>	enable		User exec mode
	설정 X , 정보 보기 (일부 정보만), 명령어실행
 Router#	configure terminal	Privileged exec mode
	설정 X, 정보 보기 (모든 정보), 명령어실행

 Router(config)#		Global configuration mode
	라우터 자체적인 설정(이름, 계정생성 등)
 Router(config-if)#		Sub configuration mode
 Router(config-subif)#
 Router(config-router)#
 Router(config-line)#
	.... 등

Router>   user exec mode
Router#   Privileged Exec mode
Router(config)#   Global configuration mode
Router(config-if)#    interface 
Router(config-router)#   router


===========================
인터페이스 셋팅

Router# config
Router(config)#int fa0/1
Router(config-if)#
Router#configure terminal
Router(config)#interface fastEthernet 0/0      ->   interface GigabitEthernet 0/0
Router(config-if)#ip address 192.168.100.254 255.255.255.0
Router(config-if)#no shutdown


========================
static 라우팅


R1 , R2  간에 
라우팅 셋팅 전 
인터페이스 등록 후 
Router# ping  명령으로   R1,R2 사이의  통신이 되는지 먼저 확인 필요 
		일반 시스템의 ping 명령어와 결과가 다름   

R1
Router# config
Router(config)# ip route 192.168.200.0 255.255.255.0 10.10.10.2
Router(config)# ip route 10.10.10.0 255.255.255.0 10.10.10.2
Router(config)# end
Router# show ip route

R2
Router# config
Router(config)# ip route 192.168.100.0 255.255.255.0 10.10.10.1
Router(config)# ip route 10.10.10.0 255.255.255.0 10.10.10.1
Router(config)# end
Router# show ip route


테스트  pc1 에서 pc3  또는 pc3 에서 pc1 으로 ping 테스트 


-------------------------------------


R1,R2,R3  인터페이스 셋팅 후  할당된 인접 인터페이스로 ping 테스트 확인 필요 


R1
Router# config
Router(config)# ip route 192.168.20.0 255.255.255.0 10.10.20.2
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.20.2
Router(config)# ip route 192.168.30.0 255.255.255.0 10.10.20.2
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.20.2
Router(config)# end
Router# show ip route

R2
Router# config
Router(config)# ip route 192.168.10.0 255.255.255.0 10.10.20.1
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.20.1
Router(config)# ip route 192.168.30.0 255.255.255.0 10.10.30.2
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.30.2
Router(config)# end
Router# show ip route

R3
Router# config
Router(config)# ip route 192.168.20.0 255.255.255.0 10.10.30.1
Router(config)# ip route 10.10.20.0 255.255.255.0 10.10.30.1
Router(config)# ip route 192.168.10.0 255.255.255.0 10.10.30.1
Router(config)# ip route 10.10.30.0 255.255.255.0 10.10.30.1
Router(config)# end
Router# show ip route




=========================
동적 라우팅 
- dynamic route : RIP, OSPF, EIGRP, BGP

RIP 
- 동적 라우팅 프로토콜이다.
- Distance Vector  라우팅 프로토콜로서  홉(거리)와 방향으로 노드를 
  계산
-  rip 초기 설정은 최대 15 개의  홉(Hop) 카운터 까지 허용
    즉 대규모 네트워크에서는 사용이 어렵다.
- default route update 주기는 30 이다.  ( 이때 경로 이상이나 새로 생긴
     경로를 갱신한다.)
- RIP v1 , RIP v2
  RIP v1 : classful routing protocol (VLSM 지원 안함)
  RIP v2 : Classless routing Protocol (VLSM 지원)
  RIP v1 : no authentication support
  RIP v2  : plain text or MD5 인증 지원
  RIP v1 : broadcast  사용하여 광고
  RIP v2 : multicast 를 사용하여 광고
  RIP v1 : 자동축약 가능( 문제는 불활성화 부분 x,  수동축약 x)
  RIP v2 : 자동축약 가능 (불활성화 부분 o , 수동축약 o)


R1 
(1)Ronuter>en   :관리자 진입
(2)Ronuter#conf t :전역 설정 모드 진입
(3)Ronuter(config)#router rip :Rip모드 진입
   Ronuter(config-router)# version 2   
(4)Ronuter(config-router)# network 192.168.100.0  :라우터 내부 IP 대역 입력
(5)Ronuter(config-router)# network 10.10.10.0  :라우터 외부 IP 대역 입력
   Ronuter(config-router)# no auto-summary ( 라우팅 정보에 포함된 네트워크와
   라우팅 정보가 전송되는 인터페이스의 주 네트워크 가  다른 지점에서 자동축약이 일어남. 그래서 auto-summary 를 꺼줌 )
(6)Ronuter(config-router)#exit  :Rip설정 모드 나가기
(7)Ronuter(config)#exit  :전역 설정 모드 나가기
(8)Router#show ip route  :셋팅이 잘 되었는지 Rip프로토콜 확인


R2 
Ronuter>en 
Ronuter#conf t 
Ronuter(config)#router rip 
Ronuter(config-router)#network 10.10.10.0 
Ronuter(config-router)#network 192.168.200.0 
Ronuter(config-router)#exit 
Ronuter(config)#exit 
Router#show ip route 


체크 1. show ip route  정보 확인하기 
       2. ping 으로 통신 확인 하기 




R1 
Ronuter>en   
Ronuter#conf t 
Ronuter(config)#router rip 
Ronuter(config-router)#network 192.168.100.0  
Ronuter(config-router)#network 10.10.10.0  
Ronuter(config-router)#exit  
Ronuter(config)#exit  
Router#show ip route  


R2 
Ronuter>en 
Ronuter#conf t 
Ronuter(config)#router rip 
Ronuter(config-router)#network 10.10.10.0 
Ronuter(config-router)#network 10.10.20.0 
Ronuter(config-router)#network 192.168.200.0 
Ronuter(config-router)#exit 
Ronuter(config)#exit 
Router#show ip route 


R3 
Ronuter>en 
Ronuter#conf t 
Ronuter(config)#router rip 
Ronuter(config-router)#network 10.10.20.0 
Ronuter(config-router)#network 192.168.50.0 
Ronuter(config-router)#exit 
Ronuter(config)#exit 
Router#show ip route 


























